In [10]:
import pandas as pd
import numpy as np

### series from list

In [11]:
# string

country = ["india", "pakistan", "shrilanka", "USA", "UK"]
pd.Series(country)

# panda called string to objects

0        india
1     pakistan
2    shrilanka
3          USA
4           UK
dtype: object

In [12]:
# intergers

runs = [34,67,45,21,46,98]
run_series = pd.Series(runs)
run_series

0    34
1    67
2    45
3    21
4    46
5    98
dtype: int64

In [13]:
# custome Index

marks = [67, 45, 89, 56, 35]
subjects = ["math", "science", "gujrati", "english", "sanskrit"]

pd.Series(marks, index=subjects)

math        67
science     45
gujrati     89
english     56
sanskrit    35
dtype: int64

In [14]:
# setting a name

marks = [67,45,89,56,35]
subjects = ['math','science','gujrati','english','sanskrit']

mark = pd.Series(marks,index=subjects,name='student ke marks')
mark

math        67
science     45
gujrati     89
english     56
sanskrit    35
Name: student ke marks, dtype: int64

### series from dict

In [15]:
mark = {
     'math':89,
     'science':67,
     'English':56,
     'hindi':45

}

marks_series = pd.Series(mark,name='sakshi mark')
marks_series

math       89
science    67
English    56
hindi      45
Name: sakshi mark, dtype: int64

### series Attributes

In [16]:
# size 
marks_series.size

4

In [17]:
# dtype
marks_series.dtype

dtype('int64')

In [18]:
#name 

marks_series.name

'sakshi mark'

In [19]:
# is unqiues

marks_series.is_unique

pd.Series([1,3,5,2,1,2,4]).is_unique

False

In [20]:
# index 
marks_series.index

Index(['math', 'science', 'English', 'hindi'], dtype='object')

In [21]:
run_series.index

RangeIndex(start=0, stop=6, step=1)

In [22]:
type(run_series.index)

pandas.core.indexes.range.RangeIndex

In [23]:
#values

marks_series.values

array([89, 67, 56, 45], dtype=int64)

### series using read_csv

In [24]:
sub = pd.read_csv('Data_Sets/subs.csv')
sub

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [25]:
sub.squeeze(axis=0)

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [26]:
vk = pd.read_csv('Data_Sets/kohli_ipl.csv',index_col='match_no')
vk

          runs
match_no
1            1
2           23
3           13
4           12
5            1
...        ...
211          0
212         20
213         73
214         25
215          7

[215 rows x 1 columns]

In [27]:
movie = pd.read_csv('Data_sets/bollywood.csv',index_col='movie')
movie

                                                  lead
movie
Uri: The Surgical Strike                 Vicky Kaushal
Battalion 609                              Vicky Ahuja
The Accidental Prime Minister (film)       Anupam Kher
Why Cheat India                          Emraan Hashmi
Evening Shadows                       Mona Ambegaonkar
...                                                ...
Hum Tumhare Hain Sanam                  Shah Rukh Khan
Aankhen (2002 film)                   Amitabh Bachchan
Saathiya (film)                           Vivek Oberoi
Company (film)                              Ajay Devgn
Awara Paagal Deewana                      Akshay Kumar

[1500 rows x 1 columns]

## series method

In [28]:
sub.head()

   Subscribers gained
0                  48
1                  57
2                  40
3                  43
4                  44

In [29]:
sub.tail(10)

     Subscribers gained
355                 149
356                 156
357                 177
358                 210
359                 209
360                 231
361                 226
362                 155
363                 144
364                 172

In [30]:
# sample 

movie.sample(5)

# random select kare

                                        lead
movie
Escape from Taliban          Manisha Koirala
Anuradha (2014 film)         Sachin Khedekar
Pink (2016 film)               Taapsee Pannu
Once Upon a Time in Mumbaai       Ajay Devgn
Na Ghar Ke Na Ghaat Ke               Om Puri

In [31]:
# values count

movie.value_counts()

lead
Akshay Kumar        48
Amitabh Bachchan    45
Ajay Devgn          38
Salman Khan         31
Sanjay Dutt         26
                    ..
Kashmira Shah        1
Kartik Elangovan     1
Karisma Kapoor       1
Karan Sharma         1
Zulfi Sayed          1
Name: count, Length: 566, dtype: int64

In [32]:
# sort values -> inplace

vk.sort_values()

TypeError: DataFrame.sort_values() missing 1 required positional argument: 'by'

In [ ]:
# sort index

## series maths function

In [ ]:
# count  vs size 
# count -> missing values ne count na kare
# size -> missing values ne counr kare

vk.count()

runs    215
dtype: int64

In [ ]:
# sum -> product

sub.sum()
# sub.product()

Subscribers gained    49510
dtype: int64

In [ ]:
# mean - median - mode - std - var

print(sub.mean(),end='\n\n')
print(vk.median(),end='\n\n')    
print(movie.mode(),end='\n\n')
print(sub.std(),end='\n\n')
print(sub.var(),end='\n\n')

Subscribers gained    135.643836
dtype: float64

runs    24.0
dtype: float64

           lead
0  Akshay Kumar

Subscribers gained    62.675023
dtype: float64

Subscribers gained    3928.158513
dtype: float64

In [ ]:
# min / max

sub.min()
sub.max()

Subscribers gained    396
dtype: int64

In [ ]:
# describe

vk.describe()

             runs
count  215.000000
mean    30.855814
std     26.229801
min      0.000000
25%      9.000000
50%     24.000000
75%     48.000000
max    113.000000

## series indexing

In [ ]:
x = pd.Series([12,13,15,34,56,46,67,56,34,79,23,57])
x[1]

13

In [ ]:
# negative series

x[-1]

# negatie indexing work na thay

# when the custome inde is string that time negative index is working and when it is not that time it is not working

In [ ]:
# slicing
vk[5:16]

          runs
match_no
6            9
7           34
8            0
9           21
10           3
11          10
12          38
13           3
14          11
15          50
16           2

## editing series

In [ ]:
marks_series

math       89
science    67
English    56
hindi      45
Name: sakshi mark, dtype: int64

In [ ]:
marks_series.iloc[1] = 78
marks_series

# ilod vager warning aave che

math       95
science    78
English    56
hindi      45
Name: sakshi mark, dtype: int64

In [ ]:
marks_series['math'] = 95
marks_series

math       95
science    78
English    56
hindi      45
Name: sakshi mark, dtype: int64

In [ ]:
marks_series['account'] = 90
marks_series

math       95
science    78
English    56
hindi      45
account    90
Name: sakshi mark, dtype: int64

## series withe python functionality

In [ ]:
sub_dic = dict(sub)
sub_dic

{'Subscribers gained': 0       48
 1       57
 2       40
 3       43
 4       44
       ...
 360    231
 361    226
 362    155
 363    144
 364    172
 Name: Subscribers gained, Length: 365, dtype: int64}

In [ ]:
sub_series = pd.Series(sub_dic)
sub_series

Subscribers gained    0       48
1       57
2       40
3       43
4 ...
dtype: object

In [ ]:
# len / type / dir /sorted / max / min

print(len(sub_series))
print(type(sub))
# print(dir(sub))
print(sorted(sub))
print(min(sub))
print(max(sub))

1
<class 'pandas.core.frame.DataFrame'>
['Subscribers gained']
Subscribers gained
Subscribers gained

## some python methods

### astype

In [35]:
# astype

marks_series

In [37]:
import sys
sys.getsizeof(marks_series)

455

In [38]:
m = marks_series.astype('int64')
m

math       89
science    67
English    56
hindi      45
Name: sakshi mark, dtype: int64

In [39]:
sys.getsizeof(m)

455

In [46]:
a = pd.Series(
    [
        45,
        87,
        23,
        56,
        89,
        56,
        24,
        46,
        8,
        52,
        89,
        74,
        1,
        67,
        35,
        85,
        33,
        35,
        67,
        56,
        12,
        47,
        97,
        43,
        23,
        46,
        98,
        35,
        23,
        75,
        12,
        43,
        79,
        32,
        57,
        98,
        12,
        63,
        89,
        53,
        36,
    ]
)
a

0     45
1     87
2     23
3     56
4     89
5     56
6     24
7     46
8      8
9     52
10    89
11    74
12     1
13    67
14    35
15    85
16    33
17    35
18    67
19    56
20    12
21    47
22    97
23    43
24    23
25    46
26    98
27    35
28    23
29    75
30    12
31    43
32    79
33    32
34    57
35    98
36    12
37    63
38    89
39    53
40    36
dtype: int64

In [47]:
a.size

41

### between

In [48]:
# between
a[a.between(20,50)].size

16

### clip

In [49]:
a.clip(10)  # 10 ni niche hoy te 10 thei jay

0     45
1     87
2     23
3     56
4     89
5     56
6     24
7     46
8     10
9     52
10    89
11    74
12    10
13    67
14    35
15    85
16    33
17    35
18    67
19    56
20    12
21    47
22    97
23    43
24    23
25    46
26    98
27    35
28    23
29    75
30    12
31    43
32    79
33    32
34    57
35    98
36    12
37    63
38    89
39    53
40    36
dtype: int64

### drop dublicates

In [52]:
# bydefault first rey aena pachi dublicate aave to remove thei jay
drop_a = a.drop_duplicates()  # keep = 'last' --> last valu rey pleu delete thei jay
drop_a

0     45
1     87
2     23
3     56
4     89
6     24
7     46
8      8
9     52
11    74
12     1
13    67
14    35
15    85
16    33
20    12
21    47
22    97
23    43
26    98
29    75
32    79
33    32
34    57
37    63
39    53
40    36
dtype: int64

In [53]:
drop_a.size

27

In [ ]:
a.dublicated()

### missing vales

In [62]:
temp = pd.Series([1, 2, 3, 4, np.nan, 5, 7, 8, np.nan, 5, 6, np.nan])

In [63]:
temp.size

12

In [65]:
temp.count()

9

### isnull

In [67]:
temp.isnull().sum()

3

### dropna

In [68]:
temp.dropna()

0     1.0
1     2.0
2     3.0
3     4.0
5     5.0
6     7.0
7     8.0
9     5.0
10    6.0
dtype: float64

### fillna

In [70]:
temp.fillna("missing")

0         1.0
1         2.0
2         3.0
3         4.0
4     missing
5         5.0
6         7.0
7         8.0
8     missing
9         5.0
10        6.0
11    missing
dtype: object

### isin -> check the multiple condition

In [81]:
a[((a > 25) & (a<50)) | (a == 50)]

0     45
7     46
14    35
16    33
17    35
21    47
23    43
25    46
27    35
31    43
33    32
40    36
dtype: int64

In [86]:
a[a.isin([24,85])]

6     24
15    85
dtype: int64

In [85]:
a.isin([24, 85]).sum()

2

### apply --> logic aply karvu hot tyare

In [88]:
name = pd.Series(['sakshi savaliya', 'yashu radadiya' , 'veeru bhanderi', 'dhuli kacchadiya', 'kashish khokhani'])
name

0     sakshi savaliya
1      yashu radadiya
2      veeru bhanderi
3    dhuli kacchadiya
4    kashish khokhani
dtype: object

In [92]:
name.apply(lambda name : name.split()[0])

0     sakshi
1      yashu
2      veeru
3      dhuli
4    kashish
dtype: object

In [93]:
a.apply(lambda x:'good day' if x > a.mean() else 'bad day')

0      bad day
1     good day
2      bad day
3     good day
4     good day
5     good day
6      bad day
7      bad day
8      bad day
9     good day
10    good day
11    good day
12     bad day
13    good day
14     bad day
15    good day
16     bad day
17     bad day
18    good day
19    good day
20     bad day
21     bad day
22    good day
23     bad day
24     bad day
25     bad day
26    good day
27     bad day
28     bad day
29    good day
30     bad day
31     bad day
32    good day
33     bad day
34    good day
35    good day
36     bad day
37    good day
38    good day
39    good day
40     bad day
dtype: object